app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("created_at", "updated_at", "comment", "user_id", "book_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2021-02-01 22:49:53.453574"], ["updated_at", "2021-02-01 22:49:53.453574"], ["comment", "rrrrrrrrr"], ["user_id", 1], ["book_id", 3]]
---
  def create
    @book = Book.find(params[:book_id])
    @book_comment = current_user.book_comments.new(book_comment_params)
    @book_comment.book_id = @book.id
    if @book_comment.save

SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 8], ["book_id", 7], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 17]]
---
  def destroy
    @book_comment = BookComment.find_by(id: params[:book_id])
    @book = @book_comment.book
    @book_comment.destroy